In [1]:
import pandas

In [2]:
pandas

In [3]:
import pandas as pd

In [4]:
pd

In [5]:
from pandas import DataFrame

In [22]:
bank = pd.read_csv('Data/Bank.csv')

In [7]:
read_csv

NameError: name 'read_csv' is not defined

In [8]:
pd.read_csv

<function pandas.io.parsers.readers.read_csv(filepath_or_buffer: 'FilePathOrBuffer', sep=<no_default>, delimiter=None, header='infer', names=<no_default>, index_col=None, usecols=None, squeeze=False, prefix=<no_default>, mangle_dupe_cols=True, dtype: 'DtypeArg | None' = None, engine=None, converters=None, true_values=None, false_values=None, skipinitialspace=False, skiprows=None, skipfooter=0, nrows=None, na_values=None, keep_default_na=True, na_filter=True, verbose=False, skip_blank_lines=True, parse_dates=False, infer_datetime_format=False, keep_date_col=False, date_parser=None, dayfirst=False, cache_dates=True, iterator=False, chunksize=None, compression='infer', thousands=None, decimal: 'str' = '.', lineterminator=None, quotechar='"', quoting=0, doublequote=True, escapechar=None, comment=None, encoding=None, encoding_errors: 'str | None' = 'strict', dialect=None, error_bad_lines=None, warn_bad_lines=None, on_bad_lines=None, delim_whitespace=False, low_memory=True, memory_map=False, float_precision=None, storage_options: 'StorageOptions' = None)>

In [9]:
bank.head()

,Employee,EducLev,JobGrade,YrHired,YrBorn,Gender,YrsPrior,PCJob,Salary
0,1,3,1,92,69,Male,1,No,32.0
1,2,1,1,81,57,Female,1,No,39.1
2,3,1,1,83,60,Female,0,No,33.2
3,4,2,1,87,55,Female,7,No,30.6
4,5,3,1,92,67,Male,0,No,29.0

In [10]:
bank.shape

(74, 9)

In [11]:
bank.describe()

,Employee,EducLev,JobGrade,YrHired,YrBorn,YrsPrior,Salary
count,74.000000,74.000000,74.0,74.000000,74.000000,74.000000,74.000000
mean,37.500000,2.013514,1.0,89.824324,69.567568,4.567568,30.544839
std,21.505813,0.851964,0.0,5.744224,11.366957,3.025377,3.121911
min,1.000000,1.000000,1.0,80.000000,52.000000,0.000000,25.004630
25%,19.250000,1.000000,1.0,85.250000,60.000000,2.000000,27.816861
50%,37.500000,2.000000,1.0,89.000000,69.000000,4.000000,30.646686
75%,55.750000,3.000000,1.0,95.000000,80.750000,7.000000,33.178027
max,74.000000,3.000000,1.0,99.000000,89.000000,10.000000,39.100000

In [12]:
bank.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 74 entries, 0 to 73
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Employee  74 non-null     int64
 1   EducLev   74 non-null     int64
 2   JobGrade  74 non-null     int64
 3   YrHired   74 non-null     int64
 4   YrBorn    74 non-null     int64
 5   Gender    74 non-null     object
 6   YrsPrior  74 non-null     int64
 7   PCJob     74 non-null     object
 8   Salary    74 non-null     float64
dtypes: float64(1), int64(6), object(2)
memory usage: 5.3+ KB

In [13]:
bank.Gender.astype('category')

0       Male
1     Female
2     Female
3     Female
4       Male
       ...
69    Female
70      Male
71    Female
72      Male
73    Female
Name: Gender, Length: 74, dtype: category
Categories (2, object): ['Female', 'Male']

In [15]:
bank.describe

<bound method NDFrame.describe of     Employee  EducLev  JobGrade  YrHired  YrBorn  Gender  YrsPrior PCJob  \
0          1        3         1       92      69    Male         1    No
1          2        1         1       81      57  Female         1    No
2          3        1         1       83      60  Female         0    No
3          4        2         1       87      55  Female         7    No
4          5        3         1       92      67    Male         0    No
..       ...      ...       ...      ...     ...     ...       ...   ...
69        70        2         1       99      69  Female         0    No
70        71        1         1       97      72    Male         3    No
71        72        3         1       89      60  Female         0    No
72        73        3         1       84      70    Male         2    No
73        74        2         1       88      63  Female         7   Yes

       Salary
0   32.000000
1   39.100000
2   33.200000
3   30.600000
4   29.000000
..        ...
69  30.446534
70  27.076937
71  27.736047
72  34.078258
73  29.479103

[74 rows x 9 columns]>

In [16]:
bank.describe()

,Employee,EducLev,JobGrade,YrHired,YrBorn,YrsPrior,Salary
count,74.000000,74.000000,74.0,74.000000,74.000000,74.000000,74.000000
mean,37.500000,2.013514,1.0,89.824324,69.567568,4.567568,30.544839
std,21.505813,0.851964,0.0,5.744224,11.366957,3.025377,3.121911
min,1.000000,1.000000,1.0,80.000000,52.000000,0.000000,25.004630
25%,19.250000,1.000000,1.0,85.250000,60.000000,2.000000,27.816861
50%,37.500000,2.000000,1.0,89.000000,69.000000,4.000000,30.646686
75%,55.750000,3.000000,1.0,95.000000,80.750000,7.000000,33.178027
max,74.000000,3.000000,1.0,99.000000,89.000000,10.000000,39.100000

In [17]:
bank.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 74 entries, 0 to 73
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Employee  74 non-null     int64
 1   EducLev   74 non-null     int64
 2   JobGrade  74 non-null     int64
 3   YrHired   74 non-null     int64
 4   YrBorn    74 non-null     int64
 5   Gender    74 non-null     category
 6   YrsPrior  74 non-null     int64
 7   PCJob     74 non-null     object
 8   Salary    74 non-null     float64
dtypes: category(1), float64(1), int64(6), object(1)
memory usage: 4.9+ KB

In [19]:
bank.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 74 entries, 0 to 73
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Employee  74 non-null     int64
 1   EducLev   74 non-null     int64
 2   JobGrade  74 non-null     int64
 3   YrHired   74 non-null     int64
 4   YrBorn    74 non-null     int64
 5   Gender    74 non-null     category
 6   YrsPrior  74 non-null     int64
 7   PCJob     74 non-null     category
 8   Salary    74 non-null     float64
dtypes: category(2), float64(1), int64(6)
memory usage: 4.6 KB

In [20]:
bank.describe(include='category')

        Gender PCJob
count       74    74
unique       2     2
top     Female    No
freq        38    73

In [23]:
bank.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 74 entries, 0 to 73
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Employee  74 non-null     int64
 1   EducLev   74 non-null     int64
 2   JobGrade  74 non-null     int64
 3   YrHired   74 non-null     int64
 4   YrBorn    74 non-null     int64
 5   Gender    74 non-null     object
 6   YrsPrior  74 non-null     int64
 7   PCJob     74 non-null     object
 8   Salary    74 non-null     float64
dtypes: float64(1), int64(6), object(2)
memory usage: 5.3+ KB

In [24]:
for col in ['Gender', 'PCJob']:
    bank[col] = bank[col].astype('category')

In [25]:
bank.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 74 entries, 0 to 73
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Employee  74 non-null     int64
 1   EducLev   74 non-null     int64
 2   JobGrade  74 non-null     int64
 3   YrHired   74 non-null     int64
 4   YrBorn    74 non-null     int64
 5   Gender    74 non-null     category
 6   YrsPrior  74 non-null     int64
 7   PCJob     74 non-null     category
 8   Salary    74 non-null     float64
dtypes: category(2), float64(1), int64(6)
memory usage: 4.6 KB